[Vehicle.Drunken.Class_Iris_DrunkenRocketTurret VehicleClassDefinition]
DisplayName="Electric rocket tower"

[Vehicle.Super.Class_Iris_SuperRocketTurret VehicleClassDefinition]
DisplayName="Rapid fire missiles"

[Weapon.Drunken.WeaponType_Iris_DrunkenRocketTurret WeaponTypeDefinition]
Typename="I suspect this bunch"
PickupMessage="there _ %s"
UseFailureLevelMessage="You must be at least %d level to use this item.."
UseFailureConstraintsMessage="You cannot use this item."
NoManufacturerName="generally"

[Weapon.Super.WeaponType_Iris_SuperRocketTurret WeaponTypeDefinition]
Typename="The pirates' tower"
PickupMessage="you understand %s"
UseFailureLevelMessage="At least %d is required to use this feature.."
UseFailureConstraintsMessage="You cannot use this item."
NoManufacturerName="usually"

